import React from 'react';

import { WithColorProps } from './types';

const CardIcon: React.FC<WithColorProps> = ({ color, ...props }) => {
  return (
    <svg
      {...props}
      xmlns="http://www.w3.org/2000/svg"
      id="card_icon"
      width="58"
      height="58"
      viewBox="0 0 58 58"
    >
      <path id="사각형_1955" fill="none" d="M0 0H58V58H0z" />
      <g id="그룹_218" transform="translate(7.691 13.604)">
        <g id="그룹_215">
          <g id="그룹_213">
            <g id="그룹_211">
              <path
                id="패스_944"
                d="M-42.825 269.362h-20.021a3.089 3.089 0 0 1-3.085-3.085V244.1a3.088 3.088 0 0 1 3.085-3.085h34.629a3.088 3.088 0 0 1 3.085 3.085v10.1a.72.72 0 0 1-.721.719.719.719 0 0 1-.719-.719v-10.1a1.648 1.648 0 0 0-1.646-1.646h-34.628a1.648 1.648 0 0 0-1.646 1.646v22.173a1.646 1.646 0 0 0 1.646 1.644h20.021a.721.721 0 0 1 .721.721.72.72 0 0 1-.721.724z"
                fill={color}
                stroke={color}
                strokeWidth=".5px"
                transform="translate(65.931 -241.018)"
              />
            </g>
            <g id="그룹_212" transform="translate(0 5.978)">
              <path
                id="패스_945"
                d="M-25.852 250.983h-39.36a.721.721 0 0 1-.719-.721v-5.481a.719.719 0 0 1 .719-.719h39.36a.72.72 0 0 1 .721.719v5.481a.721.721 0 0 1-.721.721zm-38.639-1.442h37.92V245.5h-37.92z"
                fill={color}
                stroke={color}
                strokeWidth=".5px"
                transform="translate(65.931 -244.062)"
              />
            </g>
          </g>
          <g id="그룹_214" transform="translate(3.278 16.379)">
            <path
              id="패스_946"
              d="M-50.868 250.8h-12.675a.72.72 0 0 1-.719-.721.719.719 0 0 1 .719-.719h12.675a.72.72 0 0 1 .721.719.72.72 0 0 1-.721.721z"
              fill={color}
              stroke={color}
              strokeWidth=".5px"
              transform="translate(64.262 -249.358)"
            />
          </g>
        </g>
        <g id="그룹_216" transform="translate(25.959 15.677)">
          <path
            id="패스_947"
            d="M-45.013 265.307a8.749 8.749 0 0 1-8.74-8.74 8.749 8.749 0 0 1 8.74-8.74 8.749 8.749 0 0 1 8.74 8.74 8.749 8.749 0 0 1-8.74 8.74zm0-16.26a7.529 7.529 0 0 0-7.52 7.52 7.529 7.529 0 0 0 7.52 7.52 7.529 7.529 0 0 0 7.52-7.52 7.529 7.529 0 0 0-7.52-7.52z"
            fill={color}
            stroke={color}
            strokeWidth=".5px"
            transform="translate(53.753 -247.827)"
          />
        </g>
        <path
          id="패스_948"
          d="M-40.972 253.717h-1.577l.594-2.372a.581.581 0 0 0-.422-.7.582.582 0 0 0-.7.422l-.663 2.653h-1.413l-.663-2.653a.6.6 0 0 0-1.126 0l-.663 2.653h-1.413l-.663-2.653a.584.584 0 0 0-.7-.422.581.581 0 0 0-.422.7l.594 2.372H-51.8a.58.58 0 0 0-.58.58.58.58 0 0 0 .58.58h1.866l1.05 4.2a.6.6 0 0 0 1.126 0l1.05-4.2h.64l1.05 4.2a.58.58 0 0 0 .563.439.58.58 0 0 0 .563-.439l1.05-4.2h1.866a.58.58 0 0 0 .58-.58.58.58 0 0 0-.576-.58zm-7.344 2.828l-.417-1.668h.835zm1.9-2.828l.031-.122.031.122zm1.964 2.828l-.417-1.668h.835z"
          fill={color}
          stroke={color}
          strokeWidth=".5px"
          transform="translate(81.192 -230.108)"
        />
      </g>
    </svg>
  );
};

export default CardIcon;
